# Homebrew formulae

brew "awscli"                        # AWS CLI tool
brew "colima"                        # Container runtimes on macOS (and Linux) with minimal setup
brew "docker"                        # Docker
brew "docker-compose"                # Docker Compose
brew "dockutil"                      # A command-line tool for managing macOS Dock items
brew "gh"                            # GitHub CLI - official GitHub command line tool
brew "atuin"                         # Magical shell history with sync and search
brew "zoxide"                        # Smarter cd command that learns your habits
brew "gpg"                           # GNU Privacy Guard, a tool for secure communication and data storage
brew "hadolint"                      # A Dockerfile linter that helps you build best practice Docker images
brew "ipcalc"                        # Utility for calculating IP information
brew "jq"                            # Lightweight and flexible command-line JSON processor
brew "mas"                           # Mac App Store command-line interface
brew "tmux"                          # Terminal multiplexer enabling multiple terminal sessions to be accessed simultaneously
brew "wget"                          # Internet file retriever
brew "neovim"                        # Hyperextensible Vim-based text editor
brew "ripgrep"                       # Fast regex search tool (for Telescope)
brew "fd"                            # Modern find alternative, respects .gitignore
brew "bat"                           # Cat with syntax highlighting and git integration
brew "eza"                           # Modern ls with colors, icons, git status
brew "git-delta"                     # Beautiful git diffs with syntax highlighting
brew "lazygit"                       # Terminal UI for git commands
brew "htop"                          # Interactive process viewer
brew "tldr"                          # Simplified man pages with examples
brew "tree"                          # Directory tree visualization
brew "git"                           # Latest git (newer than Apple's built-in)
brew "curl"                          # Latest curl with more protocols and features
brew "watch"                         # Run commands periodically and watch output
brew "mise"                          # Universal version manager (node, python, ruby, go, etc.)
brew "direnv"                        # Per-directory environment variables
brew "universal-ctags"               # Code navigation tags (maintained fork)
brew "yq"                            # YAML processor (like jq for YAML)
brew "shellcheck"                    # Shell script linter
brew "pipx"                          # Install Python CLI tools in isolated environments

# Homebrew casks

cask "1password"                     # Password manager and secure wallet
cask "firefox@beta"                  # Beta version of the Firefox web browser
cask "font-fira-code-nerd-font"      # Fira Code with ligatures + Nerd Font icons (powerline, devicons)
cask "google-chrome"                 # Fast, secure, and free web browser built for the modern web
# cask "grammarly"                     # Writing assistant that helps you write clear and mistake-free
# cask "linear"                        # Issue tracking and project management tool
cask "miro"                          # Online collaborative whiteboard platform
cask "rectangle"                     # Move and resize windows using keyboard shortcuts or snap areas
cask "session-manager-plugin"        # AWS Session Manager plugin
cask "slack"                         # Team communication and collaboration software
cask "sourcetree"                    # A free Git GUI client for Mac
cask "spotify"                       # Music streaming service
cask "telegram-desktop"              # Messaging app with a focus on speed and security
cask "visual-studio-code"            # Source code editor developed by Microsoft
cask "wezterm"                       # GPU-accelerated terminal emulator and multiplexer
cask "zoom"                          # Video conferencing and online meeting application
cask "docker"                        # Container runtime (required for GitHub MCP server)
# cask "tunnelblick"                 # Free, open-source graphic user interface for OpenVPN on macOS

# AI CLI tools
brew "gemini-cli"                    # Google Gemini CLI
cask "claude-code"                   # Anthropic Claude Code CLI
cask "codex"                         # OpenAI Codex CLI

